[
    {
        "id": "LesserSalmonids",
        "name": "Lesser Salmonids",
        "items": [
            {
                "id": "2.1.1",
                "name": "Chum, Smallfry, and Cohock",
                "description": "Basic Information: They tend to appear in groups rather than alone. Defeating them will earn you Power Eggs. Attack Behavior: They use their sense of smell to locate and close in on targets who have entered their territory. Once they close in on a target, they perform close-range attacks using frying pans or other cookware. Elimination: Can be neutralized relatively easily with a direct hit of ink. Supporting Information: They inhabit a restricted ocean zone, and any unauthorized contact with them is expressly forbidden by law. The Smallfry might be weak, but they're very fast. They often ambush their targets from below. The larger Cohock moves slowly but packs a real punch with direct, strong attacks. On their own, they don't pose a significant threat, but ignore them and you may quickly find yourself surrounded.",
                "image": "SmallfryChumCohock",
                "imageCaption": "Small Fry, Chum & Cohock",
                "icon": "SmallfryChumCohockIcon"
            },
            {
                "id": "2.1.2",
                "name": "Snatcher",
                "description": "Basic Information: Tasked with procuring Golden Eggs, Snatchers will emerge from the sea when Golden Eggs are present, and try to seize them and return to the depths. Any snatched Golden Eggs can be retrieved by defeating this Salmonid before it returns to the water. Attack Behavior: They're not known to attack directly. Elimination: Can be neutralized relatively easy with a direct hit of ink. Supporting Information: New recruits usually start as Snatchers to give them a taste of the battlefield. Provided they demonstrate sufficient aptitude at collecting Golden Eggs, they will be allowed to join the front lines. In recent years, aircraft have also been brought in to improve their egg-collection rates.",
                "image": "Snatchers",
                "imageCaption": "Snatchers stealing Golden Eggs",
                "icon": "SnatcherIcon"
            }
        ]
    },
    {
        "id": "BossSalmonids",
        "name": "Boss Salmonids",
        "items": [
            {
                "id": "2.2.1",
                "name": "Steelhead",
                "description": "Basic Information: An extraordinarily large specimen, it moves very slowly. Its body is covered in hard, protective skin. Shooting it with ink has no effect. Attack Behavior: It generates bombs from its head, which it throws at enemies. It can't throw these bombs very far, but the resulting explosion covers a large area. Elimination: The only way to defeat the Steelhead is to shoot ink at the bomb on its head as it inflates. Supporting Information: It's the company commander of a Salmonid troop. Its powerful physique is capable of supporting heavy armor, and its ink-resistant skin is the result of arduous conditioning. It forms the bomb on its head by collecting its own explosive saliva. Ew.",
                "image": "Steelhead",
                "imageCaption": "Steelhead",
                "icon": "SteelheadIcon"
            },
            {
                "id": "2.2.2",
                "name": "Steel Eel",
                "description": "Basic Information: It's a weapon made of connected ink-spraying devices for the supression of large areas. It locks on to and relentlessly persues a single target. Attack Behavior: Its extensive length is used to block routes as it rains down ink. Elimination: It can be neutralized by shooting the driver in the very rare of the Steel Eel. Supporting Information: The driver of the Steel Eel wears a mask to protect itself from the spray generated by the machine. The great length of the Steel Eel is attributable to the large number of interconnected ink sprayers used to create it.",
                "image": "Steeleel",
                "imageCaption": "Steel Eel",
                "icon": "SteelEelIcon"
            },
            {
                "id": "2.2.3",
                "name": "Scrapper",
                "description": "Basic Information: They're protected against almost all ink damage by their shields. Their ability to turn rapidly allows them to keep their shields facing their target. Attack Behavior: The protected afforded by their shields allows them to charge forward. Elimination: Sustained ink attacks will damage their shields and bring them to a standstill. Once the Scrapper is immobilized, move around behind it to fire through the gap in its shields and take it out. Supporting Information: The Scrapper's vehicle is a much-desired item for many Salmonids. The shields are made from odds and ends of scrap metal and old cookware. If the shields are broken, the Scrapper will have to in order to make repairs/",
                "image": "Scrapper",
                "imageCaption": "Scrapper",
                "icon": "ScrapperIcon"
            },
            {
                "id": "2.2.4",
                "name": "Stinger",
                "description": "Basic Information: It's a Salmonid sniper atop a stack of pots and pans. It's not known to move from the beach. The Salmonid on the top can't be harmed with ink-based attacks. Attack Behavior: It attacks from a distance with powerful jets of ink that can pass through walls and other obstacles. Elimination: Use your ink to knock pots away one at a time until the Salmonid lands on the flame below. Supporting Information: It boils ink in its pots to generate the pressure required for its long-range attacks. The pots are stacked high on top of a gas burner to allow the Stinger to effectively sight and attack enemies from a distance. The Salmonid on top wears protective equipment to absorb the shock from the jet of ink.",
                "image": "Stinger",
                "imageCaption": "Stinger",
                "icon": "StingerIcon"
            },
            {
                "id": "2.2.5",
                "name": "Maws",
                "description": "Basic Information: It lurks under the surface of the ink. It can swim in ink to scale walls. Attack Behavior: It appears from directly beneath its prey and can swallow it in an instant. Elimination: You can deal damage by shooting ink at when it surfaces to attack, but defeating it this way will take some time, as it is rather robust. To bring it down in one fell swoop, trick it into swallowing a bomb by placing one at its point of attack. Supporting Information: In order to sustain its large size, it must perpetually roam around, searching for prey to consume. It uses sonar to detect the location of suitable prey while submerged.",
                "image": "Maws",
                "imageCaption": "Maws",
                "icon": "MawsIcon"
            },
            {
                "id": "2.2.6",
                "name": "Drizzler",
                "description": "Basic Information: It's a floaty fighter specializing in surprising attacks. Its armored umbrella renders it essentially impervious to ink. Attack Behavior: It fires midrange attacks using special projectiles. Its projectiles explode into clouds that rain down ink. Elimination: It's susceptible to attacks immediately after it fires. With good timing, it's possible to reflect the shot and hit the Drizzler with it's own projectile, taking it down in one go. Supporting Information: The ranks of the Drizzlers are made up of renegade Salmonids who prefer to go it alone and fight on their own terms. It's well protected against ink by unusual umbrella-like armor. The immense recoil from discharging its weapon temporarily exposes the Salmonid within its armor.",
                "image": "Drizzler",
                "imageCaption": "Drizzler",
                "icon": "DrizzlerIcon"
            },
            {
                "id": "2.2.7",
                "name": "Flyfish",
                "description": "Basic Information: Each of its flanks is equipped with missle launchers capable of firing up to four missles each. It uses jet-propulsion technology to hover about. It's covered in ink-repelling armor. Attack Behavior: It's capable of locking on to two targets and firing up to four missles from each missle launcher. Elimination: Throw a bomb into one of the missle launchers to destory it. Take out both of its missile launchers to bring down the Flyfish. Support Information: It's the latest model of weapon from leading Salmonid engineers. Only the most elite Smallfry are selected to undergo special training to become Flyfish pilots. It's equipped with a space-grade reaction control system on each flank to enable a smooth, stable hover.",
                "image": "Flyfish",
                "imageCaption": "Flyfish",
                "icon": "FlyFishIcon"
            },
            {
                "id": "2.2.8",
                "name": "Fish Stick",
                "description": "Basic Information: It's a squad of flying Smallfry carrying a massive pillar. They plant the pillar in the ground, then fly around the pillar, spraying ink and generally being a nuisance. After you splat them, the pillar will stick around. Attack Behavior: Several Smallfry fly in circles above the pillar, spraying ink. Elimination: Splat all orbiting Smallfry with ink shots. Climb the pillar, and aim from the top to splat in relative safety. Supporting Information: They train to increase their lung capacity, and some are even recruited to become Stingers. As they fly in circles, they sing a cheerful tune to encourage their fellow Salmonids in battle.",
                "image": "Fishstick",
                "imageCaption": "Fish Stick",
                "icon": "FishStickIcon"
            },
            {
                "id": "2.2.9",
                "name": "Flipper-Flopper",
                "description": "Basic Information: It swims deep below the ink, then launches high into the air before diving back down. It'll place a ring of ink as it jumps, showing where it will dive. Attack Behaviour: It will ink the ground within the thrown ring, then attack anyone inside the ring as it dives in. Elimination: It's exposed while it's in the air getting ready to attack. That's your chance! If you ink the ground within its ring, it won't be able to dive back under, letting you make quick work of it. Supporting Information: It seems to idolize an animal said to have flourished in ancient times, which may explain why it wears a mask to make itself look more like this creature. It clearly attaches more importance to the beauty of its dives than its combat effectiveness.",
                "image": "Flipperflopper",
                "imageCaption": "Flipper-Flopper",
                "icon": "FlipperFlopperIcon"
            },
            {
                "id": "2.2.10",
                "name": "Slammin' Lid",
                "description": "Basic Information It's a pilot riding on a hovering, saucer-shaped craft. These provide support for other Salmonids by creating a circular force field that ink cannot pass through. Attack Behavior: Lesser Salmonids will be deployed from the hole on the bottom of the saucer. It will try to squash targets who walk into the force field. Elimination: There is a pilot stationed on top of the craft. Defeating the pilot will destroy the craft. Walk into the barrier under the Slammin' Lid, then quickly dodge when the craft drops down to splat you. Once it's down, that's yoyr chance to get on top and attack the pilot. Supporting Information: The cutting-edge technology incorporated into the craft was obtained by trading with Octarians. Because of the high cost to build these, only highly experienced veterans are allowed to pilot them. To save on weight, the craft has no weapons. This is why it attacks by trying to smash enemies beneath it.",
                "image": "Slamminlid",
                "imageCaption": "Slammin' Lid",
                "icon": "SlamminLidIcon"
            },
            {
                "id": "2.2.11",
                "name": "Big Shot",
                "description": "Basic Information: These set up a Big Shot launcher near the shore. The Big Shot launcher is loaded with cannonballs carried in from the sea, which it then fires. The attending Salmonid itself is not aggressive-it just passively goes back and forth between the sea and the Big Shot launcher. The Big Shot launcher can be used to load and fire Golden Eggs. After the Big Shot is defeated, the Big Shot launcher will stick around until the next wave. Attack Behavior: It will fire its cannonballs in the direction of the egg basket. When a cannonball lands, it creates two shock-wave attacks. Elimination: Take out the Salmonid operating the Big Shot launcher. Supporting Information: Among muscle-bound Salmonids, these with belligerent personalities tend to be assigned as Steelheads, while those with calmer despositions are assigned to Big Shots. On Salmonid holidays, Big Shot workers like to launch special fireworks in place of cannonballs to make things more festive.",
                "image": "Bigshot",
                "imageCaption": "Big Shot",
                "icon": "BigShotIcon"
            }
        ]
    },
    {
        "id": "KnownOccurrences",
        "name": "Known Occurrences",
        "items": [
            {
                "id": "2.3.1",
                "name": "Water Levels (High and Low Tides)",
                "description": "Low Tide: When the tide goes out, a large amount of land that is usually underwater will be exposed. Salmonid warriors use this land as a staging ground from which to launch coordinated attacks. During low tide, the egg basket will be stationed near this newly exposed land. High Tide: When the tide is in, there'll be much less land available. During high tide, the egg basket will be in its normal place. Advice from Mr. Grizz: During low tide, you gotta get together and move, move, move down to that exposed land, kid! During high tide-I don't care how hard it is-you gotta survive against those Salmonids! Supplementary Information: The sudden and irregular changes in the water levels are a rare phenomenon unique to areas where Salmonids like to gather. The cause is as yet unknown and is subject of much research throughout the academic world.",
                "image": "Tide",
                "imageCaption": "Tide Rising",
                "icon": "TideIcon"
            },
            {
                "id": "2.3.2",
                "name": "Rush",
                "description": "What Happens: Large groups of ferocious Salmonids appear and carry out rush attacks at furious speed. These crazed Salmonids gather whenever Glowflies appear. How to Get Golden Eggs: Take out the Goldie hidden in the school of Salmonids. Advice from Mr. Grizz: Stand your ground with your allies, and concentrate your fire on the incoming Salmonids! Watch out for Glowlies-if they buzz around you, a concentrated attack won't be far behind. Supplementary Information: It is claimed that the Salmonids' increased aggression is tied somehow to gravitational shifts due to the planet's celestial course, but there is still much that is unclear. It is said that in premedieval times, before effective defense measures such as long-range ink attacks were available, many cities fell before the rage of the Salmonid rush.",
                "image": "Rush",
                "imageCaption": "Salmonid Rushing Our Skilled Workers",
                "icon": "RushIcon"
            },
            {
                "id": "2.3.3",
                "name": "Fog",
                "description": "What Happens: The area is covered in a dense fog, drastically reducing visibility. Enemies will take advantage of the fog and attack from all directions. How to Get Golden Eggs: Defeat Boss Salmonids. The extremely rare Goldies may appear in foggy conditions. Advice from Mr. Grizz: Try to maintain contact with your teammates at all times while in the fog. Being alone in the fog is extremely dangerous. Supplementary Information: Goldies are extremely rare Salmonids-only one of every 10,000 hatchlings is a Goldie. They live longer than and possess far superior intelligence to normal Salmonid specimens.",
                "image": "Fog",
                "imageCaption": "A skilled Charger user eliminating Salmonids in the Fog",
                "icon": "FogIcon"
            },
            {
                "id": "2.3.4",
                "name": "The Griller",
                "description": "What Happens: Armored vehicles called Grillers spawn one after the other. Grillers lock their sights on to a target and will pursue it relentlessly. Smallfry are known for hitching a ride on the Griller and interfering with its targeting. How to Get Golden Eggs: Attack the weak spot on the back of the Griller to stun it. Stunning Grillers will reveal further weak points. Attacking these weak points is the key to taking down Grillers and getting Golden Eggs. Advice from Mr. Grizz: If the Griller has you in its sights, you're better of running away and letting your friends handle it. Supplementary Information: Operating costs for a single Griller would be enough to deploy a hundred regular Salmonid fighters.",
                "image": "Grillers",
                "imageCaption": "Rough Sketch of Grillers",
                "icon": "GrillersIcon"
            },
            {
                "id": "2.3.5",
                "name": "Cohock Charge",
                "description": "What Happens: Cohocks will attack in large numbers from exposed sandbanks. Mr. Grizz will deploy cannons for you to use in dealing with these foes. How to Get Golden Eggs: Defeat Boss Salmonids. Advice from Mr. Grizz: Use the cannons well to clear the way for your coworkers! Supplementary Information: Apparently there are special rooms in the Salmonid barracks set aside for large numbers to gather and practice.",
                "image": "CohockCharge",
                "imageCaption": "Cohocks being shot down by Cannons",
                "icon": "CohockChargeIcon"
            },
            {
                "id": "2.3.6",
                "name": "Goldie Seeking",
                "description": "What Happens: Large numbers of gushers will appear in the area. A Goldie will be hiding in one of the gushers. Other Salmonids will attack in their masses from the shores. Shooting open a gusher without a Goldie in it will cause it to erupt. Thankfully, there won't be anything hiding inside. How to Get Golden Eggs: Reveal the Goldie by causing the gusher it's hiding in to erupt. The Goldie will drop Golden Eggs if hit with enough ink. Advice from Mr. Grizz: Spread out, and find that Goldie FAST. When you find the Goldie, call your buddes over, and let looses with all your firepower! The gushers emit light when you hit them-the brighter the light, the closer you are to that glorious Goldie. Supplementary Information: Salmonids obtained the technology to create gushers through trade with Octarians. The more you hit the Goldie, the faster it will move!",
                "image": "GoldieSeeking",
                "imageCaption": "Goldies leaving Gushers",
                "icon": "GoldieSeekingIcon"
            },
            {
                "id": "2.3.7",
                "name": "The Mothership",
                "description": "What Happens: New troops are brought to the battleground from the Mothership. A large number of Chinooks will bring containers of lesser Salmonids from the Mothership to join the fray. Periodically, the Mothership will draw close to the egg basket and try to suck up and reclaim any Golden Eggs inside. How to Get Golden Eggs: Shoot the containers carried by Chinooks, and they'll explode. If you manage to blow up the Chinooks as well, they will drop Golden Eggs. Advice from Mr. Grizz: Split up to take out the Chinooks. If the Mothership comes to take back the Golden Eggs, everyone should focus on pushing it back! Supplementary Information: The Mothership is a vital link in the distribution chain. Deploying the Mothership is said to be the last resort of the Salmonid army. When it is dispatched, all troops stationed nearby gather to see it off.",
                "image": "TheMothership",
                "imageCaption": "The Mothership stealing Golden Eggs with Chinooks flying in",
                "icon": "TheMothershipIcon"
            },
            {
                "id": "2.3.8",
                "name": "Mudmouth Eruptions",
                "description": "What Happens: A Mudmouth will erupt out of the hole left by a gusher and open its huge mouth. Lesser Salmonids will start jumping out of the Mudmouth's mouth, one after another after another... How to Get Golden Eggs: Throw a bomb into the Mudmouth's mouth. When the bomb explodes, it'll cough up a Golden Egg. If you throw in enough bombs, the Mudmouth will explode and drop even more Golden Eggs! Sometimes you'll see one covered in golden goop. Defeat it, and it'll leave behind LOTS of Golden Eggs. Advice from Mr. Grizz: Search for the Mudmouth by tracking where the Lesser Salmonids are coming from. Mudmouths multiply as time passes, so splat 'em fast! Supplementary Information: Long ago, the mudmouth was thought to be a spirit who haunted the depths of the Splatlands seas. Now, thanks to the courage and quick thinking of Splatsville youths who thought to start throwing bombs into their mouths, we know they're just Salmonids who got stuck in a pipe and coated in mud.",
                "image": "MudmouthEruption",
                "imageCaption": "A skilled worker throwing a bomb into a Mudmouth's mouth",
                "icon": "MudmouthEruptionIcon"
            },
            {
                "id": "2.3.9",
                "name": "Giant Tornado",
                "description": "What Happens: The ground will dry up, and a gigantic tornado will whirl to life by the shore. Anything in the sea, including Salmonids, will be sucked up by the tornado and flung toward land. How to Get Golden Eggs: Boxes packed full of Golden Eggs will fall somewhere on dry land. Break open the boxes to release a large number of Golden Eggs. Advice from Mr. Grizz: Since the eggs may land far away from the basket coordinate with your coworkers and use the Egg Throw. Dodge any Salmonids that come flying toward you, or splat them as you transport the eggs. Supplementary Information: There's no way to predict when a giant tornado might appear. It will fling all kinds of things out from the ocean, which usally results in a great number of Salmonid casualties. Flying debris will be present, and accidents are bound to happen. If you become unable to use the egg basket on dry land, a single egg delivered to the basket will be counted as two.",
                "image": "GiantTornado",
                "imageCaption": "Tornados and Golden Egg chests",
                "icon": "GiantTornadoIcon"
            }
        ]
    }
]
